OpenNuvoton/M4521BSP/SampleCode/StdDriver/USBD_Audio_NAU8822_Headset/usbd_audio.c
    /* Send data */
    I2C_SET_DATA(I2C0, (uint8_t)(u16data & 0x00FF));
    I2C_SET_CONTROL_REG(I2C0, I2C_CTL_SI);
    I2C_WAIT_READY(I2C0);

    /* Send STOP */
    I2C_STOP(I2C0);

}


void WAU8822_Setup(void)
{
    I2C_WriteWAU8822(0,  0x000);   /* Reset all registers */
    CLK_SysTickDelay(10000);

    I2C_WriteWAU8822(1,  0x0EF);
    I2C_WriteWAU8822(2,  0x1BF);   /* Enable L/R Headphone, ADC Mix/Boost, ADC */
    I2C_WriteWAU8822(3,  0x07F);   /* Enable L/R main mixer, DAC */
    I2C_WriteWAU8822(4,  0x010);   /* 16-bit word length, I2S format, Stereo */
    I2C_WriteWAU8822(5,  0x000);   /* Companding control and loop back mode (all disable) */

    if(g_usbd_CodecSampleRate == 48000)
    {
        I2C_WriteWAU8822(6,  0x14D);   /* Divide by 2, 48K */
        I2C_WriteWAU8822(7,  0x000);   /* 48K for internal filter coefficients */
    }
    else if(g_usbd_CodecSampleRate == 32000)
    {
        I2C_WriteWAU8822(6,  0x16D);   /* Divide by 3, 32K */
        I2C_WriteWAU8822(7,  0x002);   /* 32K for internal filter coefficients */
    }
    else if(g_usbd_CodecSampleRate == 16000)
    {
        I2C_WriteWAU8822(6,  0x1AD);   /* Divide by 6, 16K */
        I2C_WriteWAU8822(7,  0x006);   /* 16K for internal filter coefficients */
    }
    else
    {
        I2C_WriteWAU8822(6,  0x1ED);   /* Divide by 12, 8K */
        I2C_WriteWAU8822(7,  0x00A);   /* 8K for internal filter coefficients */
    }

    I2C_WriteWAU8822(10, 0x008);   /* DAC soft mute is disabled, DAC oversampling rate is 128x */
    I2C_WriteWAU8822(14, 0x108);   /* ADC HP filter is disabled, ADC oversampling rate is 128x */
    I2C_WriteWAU8822(15, 0x0FF);   /* ADC left digital volume control */
    I2C_WriteWAU8822(16, 0x1FF);   /* ADC right digital volume control */

    I2C_WriteWAU8822(44, 0x000);   /* LLIN/RLIN is not connected to PGA */
    I2C_WriteWAU8822(45, 0x090);   /* LAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(46, 0x190);   /* RAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(47, 0x005);   /* LAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(48, 0x005);   /* RAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(50, 0x001);   /* Left DAC connected to LMIX */
    I2C_WriteWAU8822(51, 0x001);   /* Right DAC connected to RMIX */

    I2C_WriteWAU8822(52, 0x039);   /* HP Volume */
    I2C_WriteWAU8822(53, 0x139);   /* HP Volume */

    I2C_WriteWAU8822(54, 0x140);   /* LSPKOUT Volume */
    I2C_WriteWAU8822(55, 0x140);   /* RSPKOUT Volume */

    // Headphone output control
    PD->MODE = (PD->MODE & (~0x3ul << 7 * 2)) | (0x1ul << 7 * 2);
    PD7 = 0;
    printf("\nConfigure NAU8822 ... %d\n", g_usbd_CodecSampleRate);
}



void SPI1_IRQHandler(void)
{
    uint32_t u32I2SIntFlag;
    uint32_t i, u32Idx;

    u32I2SIntFlag = SPI1->I2SSTS;

    if(u32I2SIntFlag & SPI_I2SSTS_TXTHIF_Msk)
    {

        /* Fill 2 word data when it is TX threshold interrupt */
        for(i = 0; i < 2; i++)
        {
            /* Check buffer empty */
            if((g_u32PlayPos_Out != g_u32PlayPos_In) && g_u8PlayEn)
            {

                /* Check ring buffer trun around */
                u32Idx = g_u32PlayPos_Out + 1;
                if(u32Idx >= BUF_LEN)
                    u32Idx = 0;

                /* Play to I2S */
                I2S_WRITE_TX_FIFO(SPI1, g_au32PcmPlayBuf[u32Idx]);

                /* Update OUT index */
                g_u32PlayPos_Out = u32Idx;
            }
            else
            {
                /* Fill 0x0 when buffer is empty */
                I2S_WRITE_TX_FIFO(SPI1, 0x00);

                /* Buffer underrun. Disable play */
                g_u8PlayEn = 0;
            }
        }

    }

    if(u32I2SIntFlag & SPI_I2SSTS_RXTHIF_Msk)
    {
        if ((g_u32RecPos < sizeof(g_au32PcmRecBuf) / 4) && g_u8RecEn)
        {
            /*16-Bit*/
            g_au32PcmRecBuf[g_u32RecPos    ] = I2S_READ_RX_FIFO(SPI1);
            g_au32PcmRecBuf[g_u32RecPos + 1] = I2S_READ_RX_FIFO(SPI1);
            g_u32RecPos += 2;
        }
        else
        {
            I2S_READ_RX_FIFO(SPI1);
            I2S_READ_RX_FIFO(SPI1);
        }
    }
}

/**
  * @brief  SendRecData, prepare the record data for next ISO transfer.
  * @param  None.
  * @retval None.
  */
void UAC_SendRecData(void)
{
    short *p16Buf;
    short *p16Src;
    uint32_t u32Size;
    int32_t i;

    /* Get the address in USB buffer */
    p16Buf = (short *)((uint32_t)USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2));

    p16Src = (short *)g_au32PcmRecBuf;

    u32Size = g_u32RecPos * 4;

    if(u32Size > EP2_MAX_PKT_SIZE) u32Size = EP2_MAX_PKT_SIZE;

    /* Audio data is resampled to 48MHz (Audio Codec is fixed to 48MHz) */
    /* Do Resample operation to data in USB buffer to SRAM buffer */

    if(REC_CHANNELS == 2)
    {
        Resamples(E_RS_REC_CH0,     p16Src, REC_CHANNELS, srt[g_resample_rec_s_idx].count,     g_a16AudioTmpBuf0, g_resample_rec_s_idx);

        Resamples(E_RS_REC_CH1, &p16Src[1], REC_CHANNELS, srt[g_resample_rec_s_idx].count, &g_a16AudioTmpBuf0[1], g_resample_rec_s_idx);
    }
    else
        Resamples(E_RS_REC_CH0,     p16Src, REC_CHANNELS, srt[g_resample_rec_s_idx].count,     p16Buf, g_resample_rec_s_idx);

    USBD_MemCopy((uint8_t *)p16Buf, (uint8_t *)g_a16AudioTmpBuf0, g_rec_max_packet_size);

    /* Trigger ISO IN */
    USBD_SET_PAYLOAD_LEN(EP2, g_rec_max_packet_size);

    __set_PRIMASK(1);

    /*g_au32PcmRecBuf is not ring buffer. We need to copy remained data to buffer front */
    g_u32RecPos -= (u32Size / 4);
    if(g_u32RecPos)
    {
        for(i = 0; i < g_u32RecPos; i++)
            g_au32PcmRecBuf[i] = g_au32PcmRecBuf[i + u32Size / 4];
    }
    __set_PRIMASK(0);
}

/**
  * @brief  UAC_DeviceEnable. To enable the device to play or record audio data.
  * @param  u8Object: To select the device, UAC_MICROPHONE or UAC_SPEAKER.
  * @retval None.
  */
void UAC_DeviceEnable(uint8_t u8Object)
{
    if(u8Object == UAC_MICROPHONE)
    {
        /* Enable record hardware */
        g_u8RecEn = 1;

