OpenNuvoton/M4521BSP/SampleCode/StdDriver/USBD_Audio_NAU8822_Headset/usbd_audio.c
    /* Update right volume to u32R16 when left volume changed for record */
    if(i16PreRecVolumeR != g_usbd_RecVolumeR)
    {
        i16PreRecVolumeR = g_usbd_RecVolumeR;
        u32R16 = 0xFF - ((g_usbd_RecMaxVolume - g_usbd_RecVolumeR) >> 9); 
        IsChange |= 8;
    }

    /* Update R52, R53 when MUTE or volume changed */
    if((IsChange & 3) == 3)
    {
        /* Both channels need to be changed */
        I2C_WriteWAU8822(52, u32R52);
        I2C_WriteWAU8822(53, u32R53 | 0x100);
        IsChange ^= 3;
    }
    else if(IsChange & 1)
    {
        /* Only change left channel */
        I2C_WriteWAU8822(52, u32R52 | 0x100);
        IsChange ^= 1;
    }
    else if(IsChange & 2)
    {
        /* Only change right channel */
        I2C_WriteWAU8822(53, u32R53 | 0x100);
        IsChange ^= 2;
    }

    /* Update R15, R16 when MUTE or volume changed */
    if((IsChange & 0xc) == 0xc)
    {
        /* Both channels need to be changed */
        I2C_WriteWAU8822(15, u32R15);
        I2C_WriteWAU8822(16, u32R16 | 0x100);
        IsChange ^= 0xc;
    }
    else if(IsChange & 4)
    {
        /* Only change left channel */
        I2C_WriteWAU8822(15, u32R15 | 0x100);
        IsChange ^= 4;
    }
    else if(IsChange & 8)
    {
        /* Only change right channel */
        I2C_WriteWAU8822(16, u32R16 | 0x100);
        IsChange ^= 8;
    }

}

void SamplingControl(void)
{
#ifdef __FEEDBACK__
    uint8_t *pu8Buf;
#endif 
    if(g_PrePlaySampleRate != g_usbd_PlaySampleRate)
    {
        g_PrePlaySampleRate = g_usbd_PlaySampleRate;

        g_resample_play_s_idx = SamplingFactor(g_usbd_PlaySampleRate, SAMPLING_RATE);   /* Audio Codec is fixed to SAMPLING_RATE */

        printf("Play   Freq. %5dHz (%02d) - Src %5dHz to Dest %5dHz\n", g_usbd_PlaySampleRate, g_resample_play_s_idx, srt[g_resample_play_s_idx].s, srt[g_resample_play_s_idx].d);
        if(g_usbd_PlaySampleRate == AUDIO_RATE_441K)
            g_play_max_packet_size = 180;
        else
            g_play_max_packet_size = g_usbd_PlaySampleRate * PLAY_CHANNELS * 2 / 1000;

#ifdef __FEEDBACK__
    /* Feedback Endpoint */
        pu8Buf = (uint8_t *)((uint32_t)USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP4));

        g_u32SampleRate = g_usbd_PlaySampleRate / 1000;

        g_play_len_frame = g_usbd_PlaySampleRate / 1000;

        /* Prepare the data to USB IN buffer */
        *pu8Buf++ = 0x00;
        *pu8Buf++ = (g_u32SampleRate & 0x3) << 6;
        *pu8Buf = (g_u32SampleRate & 0xFC) >> 2;

        /* Trigger ISO IN */
        USBD_SET_DATA1(EP4);

        USBD_SET_PAYLOAD_LEN(EP4, 3);

    /* End of Feedback Endpoint */
#endif
    }
    if(g_PreRecSampleRate != g_usbd_RecSampleRate)
    { 
        g_PreRecSampleRate = g_usbd_RecSampleRate;

        g_rec_max_packet_size = g_usbd_RecSampleRate * REC_CHANNELS * 2 / 1000;

        g_resample_rec_s_idx = SamplingFactor(SAMPLING_RATE, g_usbd_RecSampleRate);             /* Audio Codec is fixed to SAMPLING_RATE */
        printf("Record Freq. %5dHz (%02d) - Src %5dHz to Dest %5dHz\n\n", g_usbd_RecSampleRate, g_resample_rec_s_idx, srt[g_resample_rec_s_idx].s, srt[g_resample_rec_s_idx].d);
    }
}



